%====================================================
%  Make Matrix Q and S for Zero and Sign Restrictions
%====================================================

%  2014/Dec/23 作成

%　Rubio-Ramirez, Waggoner, and Zha (2010) RES, p665-696
%  
%  p.679  Sec.5.3. Impulse Response 

% 制約条件の設定
% 短期と長期のインパルス応答の制約 1 --> 1の数は5つ (インパルス応答が0となる制約)
% 財政政策ショック
Q1 = [0 0 0 0 0 0; ...   % short run g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      1 0 0 0 0 0; ...   % long run  g
      0 1 0 0 0 0; ...   % y
      0 0 1 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 1 0 0; ...  % pi
      0 0 0 0 1 0  ]' ;     % int
  
% 短期と長期のインパルス応答の制約 2  --> 1の数は4つ
% 景気循環
Q2 =  [0 0 0 0 0 0; ...   % short run g
       0 0 0 0 0 0; ...   % y
       0 0 0 0 0 0; ...  % cons
       0 0 0 0 0 0;...     % dbt
       0 0 0 0 0 0; ...  % pi
       0 0 0 0 0 0; ...  % int
       0 0 0 0 0 0; ...   % long run  g
       1 0 0 0 0 0; ...   % y
       0 1 0 0 0 0; ...  % cons
       0 0 0 0 0 0;...     % dbt
       0 0 1 0 0 0; ...  % pi
       0 0 0 1 0 0  ]' ;     % int  


 % 短期と長期のインパルス応答の制約 3 --> 1の数は3つ
 % 金融政策 
Q3 = [0 0 1 0 0 0; ...   % short run g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 1 0 0 0 0; ...  % pi
      1 0 0 0 0 0  ]' ;     % int
 
  % 短期と長期のインパルス応答の制約 4 --> 1の数は2つ
  %　実物ショック
Q4 =  [0 0 0 0 0 0; ...   % short run g
       0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      1 0 0 0 0 0; ...  % pi
      0 1 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % intt

 % 短期と長期のインパルス応答の制約 5 --> 1の数は1つ
 % 需要ショック
Q5  =  [0 0 0 0 0 0; ...   % short run g
       0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      1 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % int
  

Q=zeros(nk,2*nk,5);
Q(:,:,1) = Q1;
Q(:,:,2) = Q2;
Q(:,:,3) = Q3;
Q(:,:,4) = Q4;
Q(:,:,5) = Q5;
%Q(:,:,1) = Q1;

% 誘導系VARモデルの分散共分散行列
%sigma = [1   0.5  1  ;...
%         0.5 4.25 2.5;...
%         1   2.5  3  ];
% invsig = inv(sigma);
% A0 = chol(invsig);
% inv(A0'*A0);
% invA0 = inv(A0');
% invA0'*invA0*A0'*A0; %
% invA0'*invA0;
% chol(sigma)'*chol(sigma);

%---------------------------

% 財政政策(政府ショック)ショックを起こす
% Gov >0 and GDP>0
S1 = [1 0 0 0 0 0; ...   % short run g
      0 1 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 -1 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % int
  
 % 景気循環ショックを起こす 
 % Y > 0
S2 = [0 0 0 0 0 0; ...   % short run g
      1 0 0 0 0 0; ...   % y
      0 1 0 0 0 0; ...  % cons
      0 0 -1 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % int

  % 金融政策ショックを起こす
  % r >0 & Pi < 0 & Y<0
S3 = [0 0 0 0 0 0; ...   % short run g
      0 -1 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 -1 0 0 0; ...  % pi
      1 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % int 

  
 S4 = [0 0 0 0 0 0; ...   % short run g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0; ...  % int
      0 0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 0; ...   % y
      0 0 0 0 0 0; ...  % cons
      0 0 0 0 0 0;...     % dbt
      0 0 0 0 0 0; ...  % pi
      0 0 0 0 0 0  ]' ;     % int
  
  
% S=zeros(nk,2*nk,nk);
S=zeros(nk,2*nk,3);
S(:,:,1) = S1;
S(:,:,2) = S2;
S(:,:,3) = S3;
% S(:,:,4) = S4;

% ----------------------------======================================
%  End of setting Matrix
% ==================================================================
